Importing pandas

In [2]:
import pandas as pd

Creating a dataframe

In [6]:
data = {
    'Name': ['Hema', 'Rekha', 'Jaya', 'Sushma'],
    'Age' : [28,35,66,12],
    'Score': [85,77,35,65]
    }

df = pd.DataFrame(data)
print(df)

     Name  Age  Score
0    Hema   28     85
1   Rekha   35     77
2    Jaya   66     35
3  Sushma   12     65

Reading a CSV

In [3]:
df = pd.read_csv("SampleData1.csv")
print(df)

     Name  Age  Score
0    Hema   28     85
1   Rekha   35     77
2    Jaya   66     35
3  Sushma   12     65

Exploring the data

In [4]:
df.head()

     Name  Age  Score
0    Hema   28     85
1   Rekha   35     77
2    Jaya   66     35
3  Sushma   12     65

In [5]:
df.tail()

     Name  Age  Score
0    Hema   28     85
1   Rekha   35     77
2    Jaya   66     35
3  Sushma   12     65

In [6]:
df.shape

(4, 3)

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   Score   4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [8]:
df.describe()

             Age      Score
count   4.000000   4.000000
mean   35.250000  65.500000
std    22.647664  21.931712
min    12.000000  35.000000
25%    24.000000  57.500000
50%    31.500000  71.000000
75%    42.750000  79.000000
max    66.000000  85.000000

Selecting Data

In [16]:
df['Name'] #Single column (Series)

0      Hema
1     Rekha
2      Jaya
3    Sushma
Name: Name, dtype: object

In [17]:
df[['Name','Score']] #Multiple columns

     Name  Score
0    Hema     85
1   Rekha     77
2    Jaya     35
3  Sushma     65

In [14]:
df.iloc[0] #First row

Name     Hema
Age        28
Score      85
Name: 0, dtype: object

In [13]:
df.loc[0,'Score'] #specific value

85

Filtering rows

In [18]:
df[df['Age'] > 30] #rows where values are greater than 30

    Name  Age  Score
1  Rekha   35     77
2   Jaya   66     35

In [20]:
df[df['Name'].str.startswith('J')] #rows where name starts with 'J'

   Name  Age  Score
2  Jaya   66     35